import pytest


@pytest.fixture
def valid_card_numbers() -> list:
    """Все валидные номера карт в одном месте"""
    return [
        ("7000792289606361", "7000 79** **** 6361"),
        ("1234567890123456", "1234 56** **** 3456"),
        ("1596837868705199", "1596 83** **** 5199"),
        # Ввод с пробелами внутри строки
        ("7000 7922 8960 6361", "7000 79** **** 6361"),
        (" 7000 7922 8960 6361 ", "7000 79** **** 6361"),
        ("Visa Platinum 7000792289606361", "Visa Platinum 7000 79** **** 6361"),
        ("MasterCard 7158300734726758", "MasterCard 7158 30** **** 6758"),
    ]


@pytest.fixture
def invalid_card() -> list:
    """Все невалидные карты в одном месте"""
    return [
        "123456789012345",  # 15 цифр - недостаточно
        "12345678901234567",  # 17 цифр - слишком много
        "1234abcd56789012",  # содержат буквы
        "1234-5678-9012-3456",  # дефисы
        "",  # пустая строка
        "      ",  # только пробелы
        "1234 5678 1234",  # неполный номер
    ]


@pytest.fixture
def valid_accounts() -> list:
    """Все валидные номера счетов"""
    return [
        ("35383033474447895560", "**5560"),
        ("73654108430135874305", "**4305"),
        ("64686473678894779589", "**9589"),
        # c пробелами и лишними пробелами
        ("3538 3033 4744 4789 5560", "**5560"),
        ("  3538 3033 4744 4789 5560  ", "**5560"),
        ("Счет 73654108430135874305", "Счет **4305"),
    ]


@pytest.fixture
def invalid_accounts() -> list:
    """Все невалидные номера счетов в одном месте"""
    return [
        "1234567890123456789",  # 19 цифр, хотя может не подходить
        "123456789012345678999999",  # 22 цифр
        "1234567890qwerty",  # с буквами
        "1234-5678-9012-3456-7890",  # дефисы
        "",  # пустая
        "      ",  # только пробелы
        "1234 5678 9012 3456",  # неполный формат
    ]


@pytest.fixture
def valid_account_card() -> list:
    return [
        ("Maestro 1596837868705199", "Maestro 1596 83** **** 5199"),
        ("Счет 64686473678894779589", "Счет **9589"),
        ("MasterCard 7158300734726758", "MasterCard 7158 30** **** 6758"),
        ("Счет 35383033474447895560", "Счет **5560"),
        ("Visa Classic 6831982476737658", "Visa 6831 98** **** 7658"),
        ("Visa Platinum 8990922113665229", "Visa 8990 92** **** 5229"),
        ("Visa Gold 5999414228426353", "Visa 5999 41** **** 6353"),
        ("Счет 73654108430135874305", "Счет **4305"),
    ]


@pytest.fixture
def invalid_account_card() -> list:
    return [
        "Maestro 15968378687099",  # меньше символов
        "Счет 6468647367889477958900",  # больше символов
        "MasterCard   ",
        "Счет 3538303347444789qq60",
        "",
        "Visa Platinum 8990-9221-1366-5229",
    ]


@pytest.fixture
def example_of_transactions() -> list:
    return [
        {"id": 41428829, "state": "EXECUTED", "date": "2019-07-03T18:35:29.512364"},
        {"id": 939719570, "state": "EXECUTED", "date": "2018-06-30T02:08:58.425572"},
        {"id": 594226727, "state": "CANCELED", "date": "2018-09-12T21:27:25.241689"},
        {"id": 615064591, "state": "CANCELED", "date": "2018-10-14T08:21:33.419441"},
    ]
